
## :white_check_mark: Apply Succeeded (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/48880)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 4 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-0d034f8397a83926f]
data.aws_region.region: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=imageapi-prod-elasticachesubnetgroup]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Refreshing state... [id=imageapi-prod]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ImageAPI-Prod-Infrastructure-Alarm-Critical]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=imageapi-prod-app]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/6d5567e5-a48b-4d03-b7cf-e6847fbbb6a8]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z04394451Q39YI4R6P8ZL]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ImageAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.kms_alias: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=72d2b1c4-ac5f-452c-8a8e-e9a487c4a55c:ImageAPI-Prod-ECS]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1037197018]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ImageAPI-Prod]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ImageAPI-Prod/ecs/app]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ImageAPI-Prod-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ImageAPI-Prod-TaskExecutionRole]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=imageapi-prod-app]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3190915749]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ImageAPI-Prod-ECSCodeDeployRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ImageAPI-Prod-TaskRolePolicy]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z04394451Q39YI4R6P8ZL__1f370c503b39d22d9b06794e319b4db7.image-api.readitlater.com._CNAME]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P46BDWB]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P0XQCHO]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/9fcdcf04a69041bfd66e0ee4be8dce26e5d9e4cb]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ImageAPI-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ImageAPI-Prod-TaskExecutionRole-2022081019011429770000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ImageAPI-Prod-TaskRole-2022081019011435580000000c]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_image-api.readitlater.com_NS]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ImageAPI-Prod-ECSCodeDeployRole-20220810190114113200000009]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-08-10 19:02:00.565 +0000 UTC]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ImageAPI-Prod-TaskExecutionRole-2022081019011426780000000a]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P3B6UY0]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PRW3WC3]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P7NUVNQ]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PNJFVMD]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/IMGAPI20220810190113698200000008/091bb6deceeb6dd5]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-049e8179c619818b1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/IMGAPI20220810190113690700000007/a9b2dc56d1c77a1c]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ImageAPI-Prod-Infrastructure-Alarm-Critical:af4334f0-4c74-49f2-91e3-5bde153784b6]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_subnets.cache_private_subnet_ids: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ImageAPI-Prod-Infrastructure-Alarm-Non-Critical:e7941e13-8746-49c8-b3d0-3707058f649f]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0a36729cd5183c86f]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/IMGAPI2022081019011563810000000d/0caf929d7017732a]
data.aws_subnets.cache_private_subnet_ids: Read complete after 0s [id=us-east-1]
data.aws_vpc.serverless_redis_vpc_D4AE9B76: Read complete after 0s [id=vpc-867638e3]
aws_security_group.serverless_redis_elasticache_security_group_31FA49DF: Refreshing state... [id=sg-013c4a7c713bad085]
aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF: Refreshing state... [id=imageapi-prod-serverless]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/IMGAPI2022081019011563810000000d/0caf929d7017732a/09e52e47497b7210]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/IMGAPI2022081019011563810000000d/0caf929d7017732a/c369b1cbfc892488]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z04394451Q39YI4R6P8ZL_image-api.readitlater.com_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ImageAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ImageAPI-Prod]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/IMGAPI2022081019011563810000000d/0caf929d7017732a/09e52e47497b7210/a74d30a074e97ae9]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=13aebde4d2e8cbbb365552a61f42d32cd74f48b4]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ImageAPI-Prod/ImageAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ImageAPI-Prod/ImageAPI-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ImageAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=b33a8a2f-60eb-429a-b817-d650e16ce821]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ImageAPI-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ImageAPI-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ImageAPI-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ImageAPI-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:164" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:884131da5f6a1e837c99bf21a8b6ccd9cccd7d95" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:a88e219721dd1fb6a148c74bd4893f8dd4b6f6a3"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 164 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 will be destroyed
  # (because aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 is not in configuration)
  - resource "aws_elasticache_replication_group" "redis_elasticache_replication_group_6DE00446" {
      - apply_immediately          = true -> null
      - arn                        = "arn:aws:elasticache:us-east-1:996905175585:replicationgroup:imageapi-prod" -> null
      - at_rest_encryption_enabled = false -> null
      - auth_token_update_strategy = "ROTATE" -> null
      - auto_minor_version_upgrade = "true" -> null
      - automatic_failover_enabled = true -> null
      - cluster_enabled            = false -> null
      - data_tiering_enabled       = false -> null
      - description                = "imageapi-prod | Managed by terraform" -> null
      - engine                     = "redis" -> null
      - engine_version             = "7.0" -> null
      - engine_version_actual      = "7.0.7" -> null
      - id                         = "imageapi-prod" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "sun:07:30-sun:08:30" -> null
      - member_clusters            = [
          - "imageapi-prod-001",
          - "imageapi-prod-002",
        ] -> null
      - multi_az_enabled           = true -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t3.micro" -> null
      - num_cache_clusters         = 2 -> null
      - num_node_groups            = 1 -> null
      - parameter_group_name       = "default.redis7" -> null
      - port                       = 6379 -> null
      - primary_endpoint_address   = "imageapi-prod.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - reader_endpoint_address    = "imageapi-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com" -> null
      - replicas_per_node_group    = 1 -> null
      - replication_group_id       = "imageapi-prod" -> null
      - security_group_ids         = [
          - "sg-0d034f8397a83926f",
        ] -> null
      - security_group_names       = [] -> null
      - snapshot_retention_limit   = 0 -> null
      - snapshot_window            = "06:00-07:00" -> null
      - subnet_group_name          = "imageapi-prod-elasticachesubnetgroup" -> null
      - tags                       = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all                   = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - transit_encryption_enabled = false -> null
      - user_group_ids             = [] -> null
    }

  # aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 will be destroyed
  # (because aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 is not in configuration)
  - resource "aws_elasticache_subnet_group" "redis_elasticache_subnet_group_EA2B92B2" {
      - arn         = "arn:aws:elasticache:us-east-1:996905175585:subnetgroup:imageapi-prod-elasticachesubnetgroup" -> null
      - description = "Managed by Terraform" -> null
      - id          = "imageapi-prod-elasticachesubnetgroup" -> null
      - name        = "imageapi-prod-elasticachesubnetgroup" -> null
      - subnet_ids  = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
          - "subnet-d09eb8ec",
        ] -> null
      - tags        = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all    = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
    }

  # aws_security_group.redis_elasticache_security_group_24BFB83E will be destroyed
  # (because aws_security_group.redis_elasticache_security_group_24BFB83E is not in configuration)
  - resource "aws_security_group" "redis_elasticache_security_group_24BFB83E" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-0d034f8397a83926f" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0d034f8397a83926f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - name                   = "ImageAPI-Prod20220810190113007000000003" -> null
      - name_prefix            = "ImageAPI-Prod" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - tags_all               = {
          - "environment" = "Prod"
          - "service"     = "ImageAPI"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 4 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ImageAPI-Prod]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Destroying... [id=imageapi-prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ImageAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=4e98d1127c2f2179ca2dbb061baa815e7bd4713a]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 30s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 40s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 50s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m0s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m30s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m40s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 1m50s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m0s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m30s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m40s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 2m50s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m0s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m30s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m40s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 3m50s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m0s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m30s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m40s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 4m50s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 5m0s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 5m10s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Still destroying... [id=imageapi-prod, 5m20s elapsed]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Destruction complete after 5m24s
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Destroying... [id=imageapi-prod-elasticachesubnetgroup]
aws_security_group.redis_elasticache_security_group_24BFB83E: Destroying... [id=sg-0d034f8397a83926f]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Destruction complete after 0s
aws_security_group.redis_elasticache_security_group_24BFB83E: Destruction complete after 1s

Apply complete! Resources: 2 added, 0 changed, 4 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"9803a762-2e99-41a8-83f4-f8c8ccbd416d","JobName":"image-api_infrastructure_apply_prod","PRNumber":170,"Program":"tfcmt","SHA1":"a88e219721dd1fb6a148c74bd4893f8dd4b6f6a3","Target":"image-api-cdk","Vars":{}} -->